In [9]:
import pandas as pd
import re
import requests
import certifi
from bs4 import BeautifulSoup

In [238]:
import pandas as pd # 0.23.0
import requests     # 2.19.1
import io

url = 'http://www.bankofengland.co.uk/boeapps/iadb/fromshowcolumns.asp?csv.x=yes'

payload = {
    'Datefrom'   : '01/Jan/2000',
    #'Dateto'     : '01/Oct/2018',
    'SeriesCodes': 'IUDBEDR',
    'CSVF'       : 'TN',
    'UsingCodes' : 'Y',
    'VPD'        : 'Y',
    'VFD'        : 'N'
}
headers = {
    'User-Agent': 'Mozilla/5.0 (X11; Linux x86_64) '
                  'AppleWebKit/537.36 (KHTML, like Gecko) '
                  'Chrome/54.0.2840.90 '
                  'Safari/537.36'
}
response = requests.get(url, params=payload, headers=headers)
tas = pd.read_csv(io.BytesIO(response.content),names=['Fecha','Tasa'],skiprows=1)
tas['Fecha']=pd.to_datetime(tas['Fecha'], format='%d %b %Y')#.dt.strftime('%d-%m-%Y')
tas.set_index('Fecha',inplace=True)
#tas=tas.resample('M').last()
tas_t=tas['Tasa'].iloc[-1]
tas_t1=tas['Tasa'].iloc[-2]
#Metrica

url='https://www.ons.gov.uk/generator?format=csv&uri=/economy/inflationandpriceindices/timeseries/l55o/mm23'
response=requests.get(url)
data = io.StringIO(response.text)
inf = pd.read_csv(data,skiprows=316,names=['Fecha','Inflacion'])
inf.columns=['Fecha','Inflacion']
inf['Fecha']=pd.to_datetime(inf['Fecha'], format='%Y %b')#.dt.strftime('%d-%m-%Y')
#metrica

url='https://www.ons.gov.uk/generator?format=csv&uri=/employmentandlabourmarket/peoplenotinwork/unemployment/timeseries/mgsx/lms'
response=requests.get(url)
data = io.StringIO(response.text)
une = pd.read_csv(data,skiprows=621,names=['Fecha','Inflacion'])
une.columns=['Fecha','Desempleo']
une['Fecha']=pd.to_datetime(une['Fecha'], format='%Y %b')#.dt.strftime('%d-%m-%Y')

In [240]:
#tas.index=pd.to_datetime(tas.index)
tas.index[-1].strftime('%b')

'May'

In [224]:
tas

           Fecha  Tasa
0     04-01-2000  5.50
1     05-01-2000  5.50
2     06-01-2000  5.50
3     07-01-2000  5.50
4     10-01-2000  5.50
...          ...   ...
6160  22-05-2024  5.25
6161  23-05-2024  5.25
6162  24-05-2024  5.25
6163  28-05-2024  5.25
6164  29-05-2024  5.25

[6165 rows x 2 columns]

In [216]:
_.head(12)

          Fecha  Tasa
0   04 Jan 2000  5.50
1   05 Jan 2000  5.50
2   06 Jan 2000  5.50
3   07 Jan 2000  5.50
4   10 Jan 2000  5.50
5   11 Jan 2000  5.50
6   12 Jan 2000  5.50
7   13 Jan 2000  5.75
8   14 Jan 2000  5.75
9   17 Jan 2000  5.75
10  18 Jan 2000  5.75
11  19 Jan 2000  5.75

In [178]:
from io import StringIO
ulr='https://www.ons.gov.uk/generator?format=csv&uri=/economy/inflationandpriceindices/timeseries/l55o/mm23'
response=requests.get(ulr)
data = StringIO(response.text)
inf = pd.read_csv(data,skiprows=316,names=['Fecha','Inflacion'])
inf.columns=['Fecha','Inflacion']
inf['Fecha']=pd.to_datetime(inf['Fecha'], format='%Y %b')
inf

         Fecha  Inflacion
0   2000-01-01        1.2
1   2000-02-01        1.2
2   2000-03-01        1.0
3   2000-04-01        0.9
4   2000-05-01        1.0
..         ...        ...
287 2023-12-01        4.2
288 2024-01-01        4.2
289 2024-02-01        3.8
290 2024-03-01        3.8
291 2024-04-01        3.0

[292 rows x 2 columns]

In [187]:
url='https://www.ons.gov.uk/generator?format=csv&uri=/employmentandlabourmarket/peoplenotinwork/unemployment/timeseries/mgsx/lms'
response=requests.get(url)
data = StringIO(response.text)
une = pd.read_csv(data,skiprows=621,names=['Fecha','Inflacion'])
une.columns=['Fecha','Desempleo']
une['Fecha']=pd.to_datetime(une['Fecha'], format='%Y %b')
une

         Fecha  Desempleo
0   2000-01-01        5.8
1   2000-02-01        5.8
2   2000-03-01        5.7
3   2000-04-01        5.6
4   2000-05-01        5.5
..         ...        ...
285 2023-10-01        3.9
286 2023-11-01        3.8
287 2023-12-01        4.0
288 2024-01-01        4.2
289 2024-02-01        4.3

[290 rows x 2 columns]